tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "zegervdv/zathura"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Python code formatter
brew "black"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: true
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Manipulates BibTeX databases
brew "bib-tool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Improved top (interactive process viewer)
brew "htop"
# Manage compile and link flags for libraries
brew "pkg-config"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Software for mathematics, science, and engineering
brew "scipy", link: false
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Access X11 clipboards from the command-line
brew "xclip"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD", "with-synctex"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Full TeX Live distribution with GUI applications
cask "mactex"
