tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "zegervdv/zathura"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Message bus system, providing inter-application communication
brew "dbus"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manipulates BibTeX databases
brew "bib-tool"
# Python code formatter
brew "black"
# Top-like interface for container metrics
brew "ctop"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Manage compile and link flags for libraries
brew "pkg-config"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Improved top (interactive process viewer)
brew "htop"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Package manager for the Lua programming language
brew "luarocks"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Cross-platform library for audio I/O
brew "portaudio"
# Show ps output as a tree
brew "pstree"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Software for mathematics, science, and engineering
brew "scipy"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Interface library
brew "zegervdv/zathura/girara", args: ["HEAD"]
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["HEAD", "with-synctex"]
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Full TeX Live distribution with GUI applications
cask "mactex"
