tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "zegervdv/zathura"
brew "python@3.12", link: false
brew "python@3.11"
brew "pango"
cask "aerospace"
brew "nvtop"
brew "bash-completion@2"
brew "node"
brew "py3cairo"
brew "pygobject3"
brew "sevenzip"
cask "font-symbols-only-nerd-font"
cask "qmk-toolbox"
brew "xdotool"
cask "podman-desktop"
brew "kitty"

